{
  "basics": {
    "name": "José Alfonso Ramos Castro",
    "label": "Junior Full Stack Developer",
    "image": "/me_avatar.png",
    "email": "ponchoramos.contact@gmail.com",
    "url": "https://ponchoramos.com",
    "summary": "My friends and on the internet I am known as Poncho, I am a Junior Full Stack Developer with a passion for building web applications. Currently seeking opportunities to further develop my skills in a professional setting.",
    "theme": "blue",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Sinaloa",
      "countryCode": "MX",
      "region": "Mexico"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Poncho Ramos",
        "url": "https://linkedin.com/in/ponchoramos"
      },
      {
        "network": "X",
        "username": "Poncho Ramos",
        "url": "https://x.com/PonchoRamosDev"
      },
      {
        "network": "GitHub",
        "username": "alfonso-ramos",
        "url": "https://github.com/alfonso-ramos"
      }
    ]
  },
  "work": [
      {
        "name": "Sositi Soluciones Informaticas",
        "position": "Frontend developer",
        "location_type": "Remote",
        "location": "Mazatlán, Sinaloa",
        "url": "https://sositi.com/",
        "startDate": "2025-03-15",
        "endDate": "",
        "summary": "Responsible for frontend development of internal web applications for businesses, using Next.js and TypeScript to build reusable, accessible, and high-performance interfaces. Remote collaboration with backend and design teams to deliver internal tools (dashboards, admin panels, and management systems) with a focus on maintainability and user experience.",
        "highlights": [
          "Frontend: Next.js (SSG/SSR), React and TypeScript for internal applications and admin panels.",
          "UI/UX: Reusable components with Tailwind CSS and Styled Components; focus on accessibility (a11y) and responsive design.",
          "Integrations: Consumption of REST APIs; authentication and authorization management (NextAuth/JWT)."
        ],
        "responsibilities": [
          "Develop and maintain Next.js applications focused on internal business flows: dashboards, admin panels, and reporting tools.",
          "Design and build a reusable UI component library to speed up new views and ensure visual consistency.",
          "Implement responsive and accessible interfaces following a11y best practices and performance testing (Lighthouse).",
          "Collaborate closely with backend engineers, designers and stakeholders to translate requirements into technical and UX solutions.",
          "Participate in code reviews, mentor colleagues and continuously improve the development workflow."
        ],
        "achievements": [
          "Delivered multiple internal applications (administrative dashboards and management tools) built with Next.js and Tailwind, ready for internal use.",
          "Created a component library and reusable patterns that reduced development time for new modules and improved visual consistency.",
          "Worked effectively with backend and design teams to meet business requirements and accessibility standards in internal products."
        ],
        "skills": [
          "Next.js",
          "TypeScript",
          "React",
          "Tailwind",
          "Styled Components",
          "GitLab",
          "REST",
          "Performance Optimization"
        ]
      },
    {
      "name": "Eighteen company",
      "position": "Trainee Fullstack Web Developer",
      "location_type": "Remote",
      "location": "Guadalajara, Jalisco",
      "url": "https://eighteen.com.mx/",
      "startDate": "2024-05-01",
      "endDate": "2024-05-01",
      "summary": "Collaborated remotely with a software company, leveraging tools like Google Meet for effective communication and Visual Studio Code for development. Contributed to the design and implementation of both frontend and backend projects, utilizing modern technologies such as React, Express, and MongoDB. Gained valuable practical experience in building scalable applications and collaborating in a professional development environment.",
      "highlights": [
        "Frontend: React – components, state management, and data handling.",
        "Backend: Express and MongoDB integration using Mongoose.","Tools: Visual Studio Code, Git, Google Meet."
      ],
      "responsibilities": [
        "Designed and implemented dynamic and user-friendly interfaces using React.",
        "Developed RESTful APIs with Express and managed databases using MongoDB with Mongoose.",
        "Utilized Git to track and share project progress in a collaborative environment.",
        "Conducted testing, debugging, and final adjustments to ensure project quality."
      ],
      "achievements": [
        "Delivered the DrinkFinder project: Successfully designed and built a fully functional user interface to search and display drink information, aligning with client requirements and receiving positive feedback.",
        "Developed a task and project manager system: Built a robust backend with efficient endpoints for managing data, alongside a basic functional frontend to complete the workflow.",
        "Completed a comprehensive project review: Conducted a final review and testing phase to ensure all deliverables met the company’s quality standards."
      ],
      "skills": [
        "React",
        "Tailwind",
        "GitHub",
        "MongoDB",
        "PostgreSQL"
      ]
    },
    {
      "name": "AWS Startups Mexico",
      "position": "Designer and Frontend developer",
      "location_type": "Remote",
      "location": "CDMX, México",
      "url": "https://startupmexico.com/",
      "startDate": "2022-06-01",
      "endDate": "2022-06-01",
      "summary": "Participated in the AWS Startups Mexico Hackathon, where our team developed KAIZEN, a B2B web application designed to streamline healthcare processes. The platform enabled the connection of patients’ biometric data with nurses, ensuring quick and efficient record-keeping. The project was built entirely using React, demonstrating expertise in modern frontend development.",
      "highlights": [
        "Frontend: Pure React – component-driven architecture and state management.",
        "Collaboration: Agile teamwork and quick prototyping under tight deadlines."
      ],
      "responsibilities": [
        "Designed and developed the user interface using pure React, ensuring a responsive and user-friendly experience.",
        "Integrated components to display and manage biometric data in real-time.",
        "Collaborated with the team to align functionality with healthcare requirements.",
        "Presented the project to a panel of judges, highlighting its impact and usability."
      ],
      "achievements": [
        "Successfully built a fully functional web application within the hackathon's time constraints.",
        "Received recognition for creating a solution focused on improving healthcare efficiency.",
        "Gained valuable experience in rapid application development and teamwork."
      ],
      "skills": [
        "Figma",
        "React",
        "SQL",
        "Git",
        "GitHub"
      ]
    },
    {
      "name": "Microsoft LaunchX Hackathon: Hack the Ocean",
      "position": "Frontend developer",
      "location_type": "Remote",
      "location": "CDMX, México",
      "url": "https://info.microsoft.com/LA-DevEngage-WBNR-FY22-02Feb-15-Launch-X-SRDEM100737_LP02-On-Demand-Registration---Form-in-Body.html",
      "startDate": "2022-02-01",
      "endDate": "2022-03-12",
      "summary": "Participated in the inaugural edition of the Hack the Ocean Hackathon organized by Microsoft LaunchX and Innovacción Virtual. Contributed as a frontend developer to create a website aimed at raising awareness about endangered marine species and connecting nonprofit organizations to foster collaboration for their protection.",
      "highlights": [
        "Frontend: HTML, CSS, and JavaScript with a focus on responsive design and a full defelopment with Vue.",
        "Collaboration: Agile development practices to meet tight deadlines."
      ],
      "responsibilities": [
        "Designed and developed the website's user interface to ensure accessibility and engagement.",
        "Implemented visually appealing components to highlight key information about endangered marine species.",
        "Collaborated with the team to integrate features that connect nonprofit organizations.",
        "Conducted testing to ensure functionality and a smooth user experience."
      ],
      "achievements": [
        "Successfully delivered a functional and visually compelling website within the hackathon's time frame.",
        "Contributed to a project with a positive social impact, promoting environmental awareness and collaboration.",
        "Gained experience in environmental-focused software development and teamwork."
      ],
      "skills": [
        "Figma",
        "Vue",
        "SQL",
        "Git",
        "GitHub"
      ]
    }
  ],
  "education": [
    {
      "institution": "Polytechnic University of Sinaloa",
      "url": "https://upsin.edu.mx/",
      "area": "IT Engineering",
      "studyType": "Bachelor",
      "startDate": "2023-08-20",
      "endDate": "2026-08-19",
      "score": "3.8",
      "courses": [
        "CS101 - Introduction to Computer Science",
        "CS102 - Data Structures"
      ]
    }
  ],
  "certificates": [
    {
      "name": "CISCO IT Essentials: PC Hardware and Software",
      "date": "2021-02-06",
      "issuer": "CISCO NetAcad Web",
      "url": "https://www.netacad.com/"
    },
    {
      "name": "Introduction to Cybersecurity",
      "date": "2020-07-10",
      "issuer": "CISCO NetAcad Web",
      "url": "https://www.netacad.com/"
    }
  ],
  "skills": [
    {
      "name": "Figma",
      "level": "Intermediate",
      "keywords": [
        "Design",
        "UI"
      ]
    },
    {
      "name": "GitHub",
      "level": "Intermediate",
      "keywords": [
        "Version Control",
        "Collaboration",
        "Source Code"
      ]
    },
    {
      "name": "HTML",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend"
      ]
    },
    {
      "name": "CSS",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend",
        "Responsive Design"
      ]
    },
    {
      "name": "JavaScript",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend",
        "Backend",
        "Fullstack"
      ]
    },
    {
      "name": "Tailwind",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend",
        "CSS Framework",
        "Responsive Design"
      ]
    },
    {
      "name": "TypeScript",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend",
        "Backend",
        "JavaScript Superset"
      ]
    },
    {
      "name": "Node",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Backend",
        "JavaScript",
        "Server"
      ]
    },
    {
      "name": "MySQL",
      "level": "Intermediate",
      "keywords": [
        "Databases",
        "SQL",
        "Data Storage",
        "Backend"
      ]
    },
    {
      "name": "MongoDB",
      "level": "Intermediate",
      "keywords": [
        "Databases",
        "SQL",
        "Data Storage",
        "Backend"
      ]
    },
    {
      "name": "Git",
      "level": "Intermediate",
      "keywords": [
        "Version Control",
        "Collaboration",
        "Source Code"
      ]
    },
    {
      "name": "Next.js",
      "level": "Beginner",
      "keywords": [
        "Web Development",
        "Frontend",
        "React Framework",
        "SSR",
        "Static Generation"
      ]
    },
    {
      "name": "React",
      "level": "Intermediate",
      "keywords": [
        "Web Development",
        "Frontend",
        "JavaScript Library",
        "UI"
      ]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Intermediate"
    },
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Technology",
      "keywords": [
        "AI",
        "Blockchain"
      ]
    }
  ],
  "references": [
    {
      "name": "Jane Smith",
      "reference": "Reference…"
    }
  ]
}